In [1]:
import pandas as pd

In [2]:
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [3]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [4]:
list('321')

['3', '2', '1']

In [7]:
df = pd.DataFrame(data, index = list('321'), columns = list('ZYX'))

In [8]:
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [23]:
df.sort_index(inplace = True)

In [24]:
df

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

In [25]:
df.sort_index(inplace = True, axis = 1)

In [26]:
df

   X  Y  Z
1  9  8  7
2  6  5  4
3  3  2  1

In [13]:
df.sort_values(by = 'X', inplace = True)

In [14]:
df

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

In [15]:
df.sort_values(by = '3', axis = 1, inplace = True)

In [17]:
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [28]:
df.sort_values(by = ['X', 'Y'], inplace = True)

In [29]:
df

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

### tarefa

In [31]:
data = [['Ary', 'M', 21], ['Cátia', 'F', 19], ['Carlos', 'M', 50 ], ['Beto', 'M', 29], ['Bruna', 'F', 31], ['Ana', 'F', 42]]
list(range(6))
df_A = pd.DataFrame(data, list(range(6)), list(['Nome', 'Sexo', 'Idade']))
df_A

     Nome Sexo  Idade
0     Ary    M     21
1   Cátia    F     19
2  Carlos    M     50
3    Beto    M     29
4   Bruna    F     31
5     Ana    F     42

In [32]:
df_B = df_A.sort_values(by = ['Sexo', 'Nome'])
df_B

     Nome Sexo  Idade
5     Ana    F     42
4   Bruna    F     31
1   Cátia    F     19
0     Ary    M     21
3    Beto    M     29
2  Carlos    M     50